nfce_debug_last.xml

<?xml version="1.0" encoding="utf-8"?><soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope"><soap12:Body><nfeDadosMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NFeAutorizacao4"><enviNFe versao="4.00" xmlns="http://www.portalfiscal.inf.br/nfe"><idLote>186678343265079</idLote><indSinc>1</indSinc><NFe xmlns="http://www.portalfiscal.inf.br/nfe"><infNFe Id="NFe35260510361831000223650010000000491982855868" versao="4.00"><ide><cUF>35</cUF><cNF>98285586</cNF><natOp>VENDA</natOp><mod>65</mod><serie>1</serie><nNF>49</nNF><dhEmi>2026-05-09T10:01:36-03:00</dhEmi><tpNF>1</tpNF><idDest>1</idDest><cMunFG>3523800</cMunFG><tpImp>4</tpImp><tpEmis>1</tpEmis><cDV>8</cDV><tpAmb>1</tpAmb><finNFe>1</finNFe><indFinal>1</indFinal><indPres>1</indPres><indIntermed>0</indIntermed><procEmi>0</procEmi><verProc>1.0.0</verProc></ide><emit><CNPJ>10361831000223</CNPJ><xNome>COXINHAS PREMIUM LTDA</xNome><xFant>COXINHAS PREMIUM CAFE</xFant><enderEmit><xLgr>Rua Coronel Fernando Prestes</xLgr><nro>898</nro><xBairro>Centro</xBairro><cMun>3523800</cMun><xMun>Itapetininga</xMun><UF>SP</UF><CEP>18200230</CEP></enderEmit><IE>371468833110</IE><CRT>3</CRT></emit><det nItem="1"><prod><cProd>6</cProd><cEAN>SEM GTIN</cEAN><xProd>Agua</xProd><NCM>22011000</NCM><CFOP>5405</CFOP><uCom>UN</uCom><qCom>1.0000</qCom><vUnCom>8.0000</vUnCom><vProd>8.00</vProd><cEANTrib>SEM GTIN</cEANTrib><uTrib>UN</uTrib><qTrib>1.0000</qTrib><vUnTrib>8.0000</vUnTrib><indTot>1</indTot></prod><imposto><ICMS><ICMS60><orig>0</orig><CST>60</CST></ICMS60></ICMS><PIS><PISNT><CST>06</CST></PISNT></PIS><COFINS><COFINSNT><CST>06</CST></COFINSNT></COFINS></imposto></det><total><ICMSTot><vBC>0.00</vBC><vICMS>0.00</vICMS><vICMSDeson>0.00</vICMSDeson><vFCP>0.00</vFCP><vBCST>0.00</vBCST><vST>0.00</vST><vFCPST>0.00</vFCPST><vFCPSTRet>0.00</vFCPSTRet><vProd>8.00</vProd><vFrete>0.00</vFrete><vSeg>0.00</vSeg><vDesc>0.00</vDesc><vII>0.00</vII><vIPI>0.00</vIPI><vIPIDevol>0.00</vIPIDevol><vPIS>0.00</vPIS><vCOFINS>0.00</vCOFINS><vOutro>0.00</vOutro><vNF>8.00</vNF></ICMSTot></total><transp><modFrete>9</modFrete></transp><pag><detPag><tPag>03</tPag><vPag>8.00</vPag><card><tpIntegra>2</tpIntegra></card></detPag></pag></infNFe><infNFeSupl><qrCode>https://www.nfce.fazenda.sp.gov.br/qrcode?p=35260510361831000223650010000000491982855868|2|1|1|E56D505F3A0B290CDE0ED9CE7A446EF95E6F8D09</qrCode><urlChave>https://www.nfce.fazenda.sp.gov.br/qrcode</urlChave></infNFeSupl><Signature xmlns="http://www.w3.org/2000/09/xmldsig#"><SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/><SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><Reference URI="#NFe35260510361831000223650010000000491982855868"><Transforms><Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><DigestValue>tATUUT0nKE8e86Z0E8BKyuo8Voo=</DigestValue></Reference></SignedInfo><SignatureValue>dIn9sHjT/aSBXux8cu5YgyYDN63QGZ9tA9gHH8gY280QEwVEr1WUX4VZSPUP/Z3j0aZPP6SC8W/Fq0AlRyAuRouo4tE+7/7szi4V5dVk5DZICltgayD/Es5BHLy+KjXekTTYjGklAm9gME4/QRflc9waWeKTwBSUJTEt6qfSR2kp+SmU0CUufrj1LsruiIE7FTf/Artdkx/MbFPo3PSb/7bhzWr+eKK28HHM8YVkS84HPkkSJWKtsYuYdMgZMAHljz0nEdkMig+eGlc7VHmUtPqY6S8kJdtiW7sdCIyTdssz5mLQgyb91NDiualpUeBM3xXETMtmCqWkOfgAdH18Ag==</SignatureValue><KeyInfo><X509Data><X509Certificate>MIIH/zCCBeegAwIBAgIKQuxsNpgNpVGy0zANBgkqhkiG9w0BAQsFADBbMQswCQYD
VQQGEwJCUjEWMBQGA1UECwwNQUMgU3luZ3VsYXJJRDETMBEGA1UECgwKSUNQLUJy
YXNpbDEfMB0GA1UEAwwWQUMgU3luZ3VsYXJJRCBNdWx0aXBsYTAeFw0yNjAyMDIx
NjUwMjlaFw0yNzAyMDIxNjUwMjlaMIHuMQswCQYDVQQGEwJCUjELMAkGA1UECAwC
U1AxFTATBgNVBAcMDFBJTEFSIERPIFNVTDETMBEGA1UECgwKSUNQLUJyYXNpbDEi
MCAGA1UECwwZQ2VydGlmaWNhZG8gRGlnaXRhbCBQSiBBMTEZMBcGA1UECwwQVmlk
ZW9jb25mZXJlbmNpYTEXMBUGA1UECwwOMzQ3NDYwNjYwMDAxNDcxHzAdBgNVBAsM
FkFDIFN5bmd1bGFySUQgTXVsdGlwbGExLTArBgNVBAMMJENPWElOSEFTIFBSRU1J
VU0gTFREQToxMDM2MTgzMTAwMDIyMzCCASIwDQYJKoZIhvcNAQEBBQADggEPADCC
AQoCggEBAKr0spEk7IfMR5QqGozJPDdOkaWNP7PJAuA5IumYSyexHdTl9nYNhCpC
AYye2PO3+LR1LN8njtN2N7JlFRIwD4ge72dIu6QtJvVAuKnqB9LZQI+GijrQtXl1
sisWtO1z2PIPcgmh/LQy+NYrww2Iq2TH03/D0/fuc9ar5MrJ+Hd/jhIkmrTlCOMD
CVKQOIZlmbiuQIrRdYAlAfD5jfaW1Jpu0nmvWty+VonFFNjvQGu2HpQlM+a+py8o
iieLJ+YWYq2dbBS7gnkL7G86cHLpyBViE+VVpVHyjDtBV+WGf1Y0O88WZIaPe8Dr
6lkLjXQ1LLjCjYDb9KnR3yXKvMXxo+cCAwEAAaOCAy8wggMrMA4GA1UdDwEB/wQE
AwIF4DAdBgNVHSUEFjAUBggrBgEFBQcDBAYIKwYBBQUHAwIwCQYDVR0TBAIwADAf
BgNVHSMEGDAWgBST4f9+HeX15E3hOWKLIWmV5q9yFjAdBgNVHQ4EFgQUbJ08muyM
1eJI/aA+ouzYeMkniX8wfwYIKwYBBQUHAQEEczBxMG8GCCsGAQUFBzAChmNodHRw
Oi8vc3luZ3VsYXJpZC5jb20uYnIvcmVwb3NpdG9yaW8vYWMtc3luZ3VsYXJpZC1t
dWx0aXBsYS9jZXJ0aWZpY2Fkb3MvYWMtc3luZ3VsYXJpZC1tdWx0aXBsYS5wN2Iw
gYIGA1UdIAR7MHkwdwYHYEwBAgGBBTBsMGoGCCsGAQUFBwIBFl5odHRwOi8vc3lu
Z3VsYXJpZC5jb20uYnIvcmVwb3NpdG9yaW8vYWMtc3luZ3VsYXJpZC1tdWx0aXBs
YS9kcGMvZHBjLWFjLXN5bmd1bGFySUQtbXVsdGlwbGEucGRmMIHDBgNVHREEgbsw
gbigHwYFYEwBAwKgFgQUQ0xBVURJTkVJIERPUyBTQU5UT1OgGQYFYEwBAwOgEAQO
MTAzNjE4MzEwMDAyMjOgQgYFYEwBAwSgOQQ3MjUwMjE5ODAyOTE3NzkyMjgwODAw
MDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMKAXBgVgTAEDB6AOBAww
MDAwMDAwMDAwMDCBHUNsYXVkaW5laXNhbnRvcy4yNUBpY2xvdWQuY29tMIHiBgNV
HR8EgdowgdcwZKBioGCGXmh0dHA6Ly9zeW5ndWxhcmlkLmNvbS5ici9yZXBvc2l0
b3Jpby9hYy1zeW5ndWxhcmlkLW11bHRpcGxhL2xjci9sY3ItYWMtc3luZ3VsYXJp
ZC1tdWx0aXBsYS5jcmwwb6BtoGuGaWh0dHA6Ly9pY3AtYnJhc2lsLnN5bmd1bGFy
aWQuY29tLmJyL3JlcG9zaXRvcmlvL2FjLXN5bmd1bGFyaWQtbXVsdGlwbGEvbGNy
L2xjci1hYy1zeW5ndWxhcmlkLW11bHRpcGxhLmNybDANBgkqhkiG9w0BAQsFAAOC
AgEAL6Dz5CgtN/KSU1EyZJgYQX+ZRy8urRuLeOnLPTWQ8RSAm/vfcWXUbAy2lgl/
j6mVqfg+qLfDsQlQfiL2AmfTriqOFt8zRp8BGH+FYeFOm+nMEQ+yYjaGvbtjbYPj
L2QNCCCy7EHiG+wlGKm8Ls1pz1jy4dmNn5tGA9yE9FdG5L6eoQNpZKw9GEeKY9DV
FdmMTayRGoMN5QjGV0k/3UBFjMI38F37rNN6x1Oq7kNV48Ka7v7d+XeDF+KqlO6Y
kjAPKw/R5jCeDKNIXAtRV6GNrdNoki2BwKFHl3dIbebVVsc5TRvHJPXF7kMIyJc4
HPSi7JIBSlpEagZOk6uFa2X4K9ACZewvbANIBu51JhZEBJ59bWXUBBRWh10qy+m2
KSs0raJIMYzWKbPGiX2sfluJrkfNyXfy9VgcPRi2r23PwcDmC94Wg5UUHbb2ujfW
UGXG8qMMS+M8VYVuLAItkyXtxMLXml9zkfI0DNtC8AqyxP5/yJ38fDVY3hC5RThx
GdRX5KsTNun8Nc8qYWf0kCaURCuP8r5RBQ2a7ofTu1O4/r+c3M3r7D4m79s6dhAU
pm8VR9xaWDyBVtSO/1d3xqE80+9raAexWC7ZCvMnekrqYTz9fJNP7jETBTKiFmCL
bedsDAr1F72ej5dE005xbOEaQbE+dvVXmptitR+ojKrfVhM=
</X509Certificate></X509Data></KeyInfo></Signature></NFe></enviNFe></nfeDadosMsg></soap12:Body></soap12:Envelope>