docs/envelope-simples.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
<soap12:Header>
<nfeCabecMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NFeAutorizacao4">
<cUF>13</cUF>
<versaoDados>4.00</versaoDados>
</nfeCabecMsg>
</soap12:Header>
<soap12:Body>
<nfeDadosMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NFeAutorizacao4">
<enviNFe xmlns="http://www.portalfiscal.inf.br/nfe" versao="4.00">
<idLote>1</idLote>
<indSinc>1</indSinc>
<NFe xmlns="http://www.portalfiscal.inf.br/nfe">
<infNFe Id="NFe13251018053139000169650020017019481194824637" versao="4.00">
<ide>
<cUF>13</cUF>
<cNF>19482463</cNF>
<natOp>VENDA CONSUMIDOR</natOp>
<mod>65</mod>
<serie>2</serie>
<nNF>001701948</nNF>
<dhEmi>2025-10-27T20:26:20-03:00</dhEmi>
<tpNF>1</tpNF>
<idDest>1</idDest>
<cMunFG>1302603</cMunFG>
<tpImp>4</tpImp>
<tpEmis>1</tpEmis>
<cDV>7</cDV>
<tpAmb>2</tpAmb>
<finNFe>1</finNFe>
<indFinal>1</indFinal>
<indPres>1</indPres>
<procEmi>1</procEmi>
<verProc>4.00</verProc>
</ide>
<emit>
<CNPJ>18053139000169</CNPJ>
<xNome>LEAO DE JUDA SOLUCOES EM TECNOLOGIA EIRELI - ME</xNome>
<xFant>LEAO DE JUDA SOLUCOES EM TECNOLOGIA EIRELI - ME</xFant>
<enderEmit>
<xLgr>Rua Ararangua</xLgr>
<nro>211</nro>
<xBairro>Cidade Nova</xBairro>
<cMun>1302603</cMun>
<xMun>Manaus</xMun>
<UF>AM</UF>
<CEP>69090786</CEP>
</enderEmit>
<IE>053374665</IE>
<CRT>1</CRT>
</emit>
<dest>
<CPF>74978004268</CPF>
<xNome>REGINALDO MONTEIRO DA SILVA</xNome>
<indIEDest>9</indIEDest>
</dest>
<det nItem="1">
<prod>
<cProd>418619</cProd>
<cEAN>SEM GTIN</cEAN>
<xProd>PRODUTO TESTE HOMOLOGACAO</xProd>
<NCM>84713010</NCM>
<CFOP>5102</CFOP>
<uCom>PC</uCom>
<qCom>10.0000</qCom>
<vUnCom>4.3600</vUnCom>
<vProd>43.60</vProd>
<cEANTrib>SEM GTIN</cEANTrib>
<uTrib>PC</uTrib>
<qTrib>10.0000</qTrib>
<vUnTrib>4.3600</vUnTrib>
<indTot>1</indTot>
</prod>
<imposto>
<ICMS>
<ICMSSN102>
<orig>0</orig>
<CSOSN>102</CSOSN>
</ICMSSN102>
</ICMS>
<PIS>
<PISNT>
<CST>07</CST>
</PISNT>
</PIS>
<COFINS>
<COFINSNT>
<CST>07</CST>
</COFINSNT>
</COFINS>
</imposto>
</det>
<total>
<ICMSTot>
<vBC>0.00</vBC>
<vICMS>0.00</vICMS>
<vICMSDeson>0.00</vICMSDeson>
<vFCP>0.00</vFCP>
<vBCST>0.00</vBCST>
<vST>0.00</vST>
<vFCPST>0.00</vFCPST>
<vFCPSTRet>0.00</vFCPSTRet>
<vProd>43.60</vProd>
<vFrete>0.00</vFrete>
<vSeg>0.00</vSeg>
<vDesc>0.00</vDesc>
<vII>0.00</vII>
<vPIS>0.00</vPIS>
<vCOFINS>0.00</vCOFINS>
<vOutro>0.00</vOutro>
<vNF>43.60</vNF>
</ICMSTot>
</total>
<transp>
<modFrete>0</modFrete>
</transp>
<pag>
<detPag>
<tPag>17</tPag>
<vPag>43.60</vPag>
</detPag>
<vTroco>0.00</vTroco>
</pag>
</infNFe>
</NFe>
</enviNFe>
</nfeDadosMsg>
</soap12:Body>
</soap12:Envelope>